/*
Внутри функции main (объявлять функцию не нужно) необходимо написать программу:

На первом этапе на стандартный ввод подается 10 целых положительных чисел, которые должны быть записаны в порядке ввода в массив из 10 элементов. Тип чисел, входящих в массив, должен соответствовать минимально возможному целому беззнаковому числу. Имя массива который вы должны сами создать workArray (условие обязательное). Для чтения из стандартного ввода уже импортирован пакет fmt.

На втором этапе на стандартный ввод подаются еще 3 пары чисел - индексы элементов этого массива, которые требуется поменять местами (если такая пара чисел 3 и 7, значит в массиве элемент с 3 индексом нужно поменять местами с элементом, индекс которого 7).

Элементы полученного массива должны быть выведены через пробел на стандартный вывод.
*/
package main

import (
	"fmt"
)

func main() {
	var workArray [10]byte
	for i := 0; i < 10; i++ {
		fmt.Scanf("%d", &workArray[i])
	}

	var left, right int
	data := &workArray

	for i := 0; i < 3; i++ {
		fmt.Scan(&left)
		fmt.Scan(&right)

		data[left], data[right] = data[right], data[left]
	}

	for i := 0; i < len(data); i++ {
		fmt.Print(data[i], " ")
	}
}
